{"scraped_deal": "🚑 BioAge Labs, a Richmond, Calif.-based developer of anti-obesity therapies, raised $170m in Series D funding. Sofinnova Investments led, and was joined by Longitude Capital, RA Capital, Cormorant Asset Management, RTW Investments, SV Health Investors, OrbiMed Advisors, Sands Capital, Pivotal bioVenture Partners, Osage University Partners, Lilly Ventures, Amgen Ventures and insider a16z. www.bioagelabs.com"}
{"scraped_deal": "• Finom, a Dutch challenger bank for SMEs and freelancers, raised €50m in Series B funding. Northzone and insider General Catalyst co-led, and was joined by Target Global, Cogito Capital, Entrée Capital, FJLabs, and S16vc. https://axios.link/48gd5eN"}
{"scraped_deal": "• Antithesis, an autonomous software testing and debugging startup, raised $47m in seed funding from Amplify Partners, Tamarack Global, and First In Ventures. www.antithesis.com"}
{"scraped_deal": "• Bob W, a Finnish marketplace for short-term apartment rentals, raised €40m in Series B funding. Evli Growth led, and was joined by Flashpoint and Taavet+Sten. https://axios.link/42BCJJw"}
{"scraped_deal": "🚑 Sudo Biosciences, a Carmel, Ind.-based developer of precision TYK2 inhibitors, raised $30m in Series B funding from Dementia Discovery Fund, Leaps by Bayer, and UPMC Enterprises. www.sudobio.com"}
{"scraped_deal": "• Analog, an SF-based cross-chain communications project, raised $16m at a $120m valuation led by Tribe Capital. https://axios.link/3HWQJUL"}
{"scraped_deal": "• Diraq, an Australian quantum computing startup, raised A$15m in Series A2 funding led by Quantonation. https://axios.link/3ut4g3r"}
{"scraped_deal": "• Navro (fka Patrix), a London-based international payments company, raised $14m co-led by Bain Capital and Unusual Ventures. https://axios.link/4bDgqYj"}
{"scraped_deal": "⚡ Camus Energy, an SF-based grid orchestration platform, raised $10m in Series A extension funding co-led by Congruent Ventures and Wave Capital. www.camus.energy"}
{"scraped_deal": "• Quilter, a Santa Clara, Calif.-based automated circuit board design company, raised $10m in Series A funding led by Benchmark. www.quilter.ai"}
{"scraped_deal": "🎵 Groover, a French music promotion platform, raised $8m in Series A funding from OneRagtime, Trind, Techmind, MozzaAngels, and insiders Partech, Bpifrance, Verve Ventures, and Frenchfounders. https://axios.link/48ffF4v"}
{"scraped_deal": "• Seal Security, a London-based cybersecurity startup focused on open source vulnerability remediation, raised $7.4m in seed funding. Vertex Ventures Israel led, and was joined by Crew Capital, PayPal Alumni Fund, and Cyber Club London. www.seal.security"}
{"scraped_deal": "• Superform Labs, a crypto yield marketplace, raised $6.5m in seed funding. Polychain Capital led, and was joined by BlockTower Capital, Maven 11, CMT Digital, Circle, Hypersphere Ventures, and Dialectic. https://axios.link/3P3npAb"}
{"scraped_deal": "• Motif Analytics, an SF-based provider of sequence analytics raised $5.7m in seed funding co-led by Amplify Partners and Felicis. https://axios.link/4bwVjGR"}
{"scraped_deal": "• Civic Roundtable, a Boston-based collaboration platform for government employees, raised $5m in seed funding led by General Catalyst. www.civicroundtable.com"}
{"scraped_deal": "• Cascading AI, an SF-based loan origination platform, raised $3.9m in pre-seed funding. Peterson Ventures led, and was joined by YC, The Sarah Smith Fund, and Clocktower Technology Ventures. www.cascading.ai"}
{"scraped_deal": "• ADC Aerospace, a Beuna Park, Calif.-based portfolio company of GreyLion, acquired Cast Rite, a Gardena, Calif.-based provider of die casting and fabrication solutions. www.adc-aerospace.com"}
{"scraped_deal": "• Blackstone is merging St Modwen and Industrials REIT, both U.K. industrial property owners, along with related assets to form a new company called Indurent. https://axios.link/3utKZin"}
{"scraped_deal": "🎵 Cinq Music, an LA-based music rights management firm, raised $250m from parent company GoDigital. https://axios.link/49CqeA1"}
{"scraped_deal": "• Clayton Dubilier & Rice completed its purchase of Massillon, Ohio-based snack-maker Shearer's Foods from Ontario Teachers' Pension Plan Board. https://axios.link/3NotrdC"}
{"scraped_deal": "• Nordic Capital agreed to buy a majority stake in Zafin, a Canadian provider of SaaS core modernization solutions for financial institutions that had raised funding from Kayne Anderson and Vistara Growth. www.zafin.com"}
{"scraped_deal": "• Rind Snacks, a portfolio company of Valor Equity Partners, acquired Small Batch Organics, a Manchester Center, Vt.-based maker of granola products. https://axios.link/42DCf5O"}
{"scraped_deal": "• Sixth Street Partners invested in Blue Stream Fiber, a Coral Springs, Fla.-based broadband provider owned by GI Partners. www.bluestreamfiber.com"}
{"scraped_deal": "🚑 Whistler Capital Partners invested in AmeriPro, an Atlanta-based medical transportation and patient logistics company. www.ameriprohealth.com"}
{"scraped_deal": "• Zendesk, a portfolio company of Hellman & Friedman and Permira, acquired Klaus, an Estonian QA startup that had raised over $19m from Global Founders Capital, Acton Capital, Icebreaker.vc, and Creandum. https://axios.link/3SWxRM5"}
{"scraped_deal": "• Blue Road Capital is seeking to sell Diamond Foods, a Stockton, Calif.-based maker of nut products, per PE Hub. https://axios.link/49bqSnY"}
{"scraped_deal": "• Carl Icahn reported nearly a 10% stake in JetBlue Airways (Nasdaq: JBLU), and said he has interest in board representation. https://axios.link/49fwQV2"}
{"scraped_deal": "• Homebrew, the seed-stage firm led by Hunter Walk and Satya Patel, is raising $50m for a new fund, per an SEC filing."}
{"scraped_deal": "⚡ Inyarek Partners launched as a Boston-based PE firm focused on the energy transition, led by three former partners of Old Ironsides Energy. www.inyarek.com"}
{"scraped_deal": "• Greenfield Partners of Israel promoted Raz Mangel to partner. https://axios.link/4buXM4N"}
{"scraped_deal": "Venture capital and private equity distributions have fallen to lows not seen since the financial crisis, Axios' Kate Marino writes."}
